Tekla Open API Reference for Tekla Structures 2025
Contour.GetPolycurve Method
 Gets the contour geometry as Polycurve
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Polycurve GetPolycurve()
Public Function GetPolycurve As Polycurve
Return Value
Type: Polycurve
Polycurve
See Also
Reference
Contour Class
Tekla.Structures.Model Namespace